MicrochipTech/PIC32CXBZx_WBZx51_BLE_HANDOVER_CAN/apps/001_peripheral/firmware/src/packs/WBZ451H_DFP/component/nvm.h
#define NVM_NVMDATA4_NVMDATA4_Pos             _UINT32_(0)                                          /* (NVM_NVMDATA4)  Position */
#define NVM_NVMDATA4_NVMDATA4_Msk             (_UINT32_(0xFFFFFFFF) << NVM_NVMDATA4_NVMDATA4_Pos)  /* (NVM_NVMDATA4)  Mask */
#define NVM_NVMDATA4_NVMDATA4(value)          (NVM_NVMDATA4_NVMDATA4_Msk & (_UINT32_(value) << NVM_NVMDATA4_NVMDATA4_Pos)) /* Assigment of value for NVMDATA4 in the NVM_NVMDATA4 register */
#define NVM_NVMDATA4_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (NVM_NVMDATA4) Register Mask  */


/* -------- NVM_NVMDATA5 : (NVM Offset: 0x90) (R/W 32)  -------- */
#define NVM_NVMDATA5_RESETVALUE               _UINT32_(0x00)                                       /*  (NVM_NVMDATA5)   Reset Value */

#define NVM_NVMDATA5_NVMDATA5_Pos             _UINT32_(0)                                          /* (NVM_NVMDATA5)  Position */
#define NVM_NVMDATA5_NVMDATA5_Msk             (_UINT32_(0xFFFFFFFF) << NVM_NVMDATA5_NVMDATA5_Pos)  /* (NVM_NVMDATA5)  Mask */
#define NVM_NVMDATA5_NVMDATA5(value)          (NVM_NVMDATA5_NVMDATA5_Msk & (_UINT32_(value) << NVM_NVMDATA5_NVMDATA5_Pos)) /* Assigment of value for NVMDATA5 in the NVM_NVMDATA5 register */
#define NVM_NVMDATA5_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (NVM_NVMDATA5) Register Mask  */


/* -------- NVM_NVMDATA6 : (NVM Offset: 0xA0) (R/W 32)  -------- */
#define NVM_NVMDATA6_RESETVALUE               _UINT32_(0x00)                                       /*  (NVM_NVMDATA6)   Reset Value */

#define NVM_NVMDATA6_NVMDATA6_Pos             _UINT32_(0)                                          /* (NVM_NVMDATA6)  Position */
#define NVM_NVMDATA6_NVMDATA6_Msk             (_UINT32_(0xFFFFFFFF) << NVM_NVMDATA6_NVMDATA6_Pos)  /* (NVM_NVMDATA6)  Mask */
#define NVM_NVMDATA6_NVMDATA6(value)          (NVM_NVMDATA6_NVMDATA6_Msk & (_UINT32_(value) << NVM_NVMDATA6_NVMDATA6_Pos)) /* Assigment of value for NVMDATA6 in the NVM_NVMDATA6 register */
#define NVM_NVMDATA6_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (NVM_NVMDATA6) Register Mask  */


/* -------- NVM_NVMDATA7 : (NVM Offset: 0xB0) (R/W 32)  -------- */
#define NVM_NVMDATA7_RESETVALUE               _UINT32_(0x00)                                       /*  (NVM_NVMDATA7)   Reset Value */

#define NVM_NVMDATA7_NVMDATA7_Pos             _UINT32_(0)                                          /* (NVM_NVMDATA7)  Position */
#define NVM_NVMDATA7_NVMDATA7_Msk             (_UINT32_(0xFFFFFFFF) << NVM_NVMDATA7_NVMDATA7_Pos)  /* (NVM_NVMDATA7)  Mask */
#define NVM_NVMDATA7_NVMDATA7(value)          (NVM_NVMDATA7_NVMDATA7_Msk & (_UINT32_(value) << NVM_NVMDATA7_NVMDATA7_Pos)) /* Assigment of value for NVMDATA7 in the NVM_NVMDATA7 register */
#define NVM_NVMDATA7_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (NVM_NVMDATA7) Register Mask  */


/* -------- NVM_NVMSRCADDR : (NVM Offset: 0xC0) (R/W 32)  -------- */
#define NVM_NVMSRCADDR_RESETVALUE             _UINT32_(0x00)                                       /*  (NVM_NVMSRCADDR)   Reset Value */

#define NVM_NVMSRCADDR_NVMSRCADDR_Pos         _UINT32_(0)                                          /* (NVM_NVMSRCADDR)  Position */
#define NVM_NVMSRCADDR_NVMSRCADDR_Msk         (_UINT32_(0xFFFFFFFF) << NVM_NVMSRCADDR_NVMSRCADDR_Pos) /* (NVM_NVMSRCADDR)  Mask */
#define NVM_NVMSRCADDR_NVMSRCADDR(value)      (NVM_NVMSRCADDR_NVMSRCADDR_Msk & (_UINT32_(value) << NVM_NVMSRCADDR_NVMSRCADDR_Pos)) /* Assigment of value for NVMSRCADDR in the NVM_NVMSRCADDR register */
#define NVM_NVMSRCADDR_Msk                    _UINT32_(0xFFFFFFFF)                                 /* (NVM_NVMSRCADDR) Register Mask  */


/* -------- NVM_NVMPWPLT : (NVM Offset: 0xD0) (R/W 32)  -------- */
#define NVM_NVMPWPLT_RESETVALUE               _UINT32_(0x00)                                       /*  (NVM_NVMPWPLT)   Reset Value */

#define NVM_NVMPWPLT_PWPLT_Pos                _UINT32_(0)                                          /* (NVM_NVMPWPLT)  Position */
#define NVM_NVMPWPLT_PWPLT_Msk                (_UINT32_(0xFFFFFF) << NVM_NVMPWPLT_PWPLT_Pos)       /* (NVM_NVMPWPLT)  Mask */
#define NVM_NVMPWPLT_PWPLT(value)             (NVM_NVMPWPLT_PWPLT_Msk & (_UINT32_(value) << NVM_NVMPWPLT_PWPLT_Pos)) /* Assigment of value for PWPLT in the NVM_NVMPWPLT register */
#define NVM_NVMPWPLT_ULOCK_Pos                _UINT32_(31)                                         /* (NVM_NVMPWPLT)  Position */
#define NVM_NVMPWPLT_ULOCK_Msk                (_UINT32_(0x1) << NVM_NVMPWPLT_ULOCK_Pos)            /* (NVM_NVMPWPLT)  Mask */
#define NVM_NVMPWPLT_ULOCK(value)             (NVM_NVMPWPLT_ULOCK_Msk & (_UINT32_(value) << NVM_NVMPWPLT_ULOCK_Pos)) /* Assigment of value for ULOCK in the NVM_NVMPWPLT register */
#define NVM_NVMPWPLT_Msk                      _UINT32_(0x80FFFFFF)                                 /* (NVM_NVMPWPLT) Register Mask  */


/* -------- NVM_NVMPWPLTCLR : (NVM Offset: 0xD4) (R/W 32)  -------- */
#define NVM_NVMPWPLTCLR_RESETVALUE            _UINT32_(0x00)                                       /*  (NVM_NVMPWPLTCLR)   Reset Value */

#define NVM_NVMPWPLTCLR_Msk                   _UINT32_(0x00000000)                                 /* (NVM_NVMPWPLTCLR) Register Mask  */


/* -------- NVM_NVMPWPLTSET : (NVM Offset: 0xD8) (R/W 32)  -------- */
#define NVM_NVMPWPLTSET_RESETVALUE            _UINT32_(0x00)                                       /*  (NVM_NVMPWPLTSET)   Reset Value */

#define NVM_NVMPWPLTSET_Msk                   _UINT32_(0x00000000)                                 /* (NVM_NVMPWPLTSET) Register Mask  */


/* -------- NVM_NVMPWPLTINV : (NVM Offset: 0xDC) (R/W 32)  -------- */
#define NVM_NVMPWPLTINV_RESETVALUE            _UINT32_(0x00)                                       /*  (NVM_NVMPWPLTINV)   Reset Value */

#define NVM_NVMPWPLTINV_Msk                   _UINT32_(0x00000000)                                 /* (NVM_NVMPWPLTINV) Register Mask  */


