MicrochipTech/PIC32CXBZx_WBZx51_BLE_HANDOVER_CAN/apps/001_peripheral/firmware/src/packs/WBZ451H_DFP/component/nvm.h
#define NVM_NVMLBWPINV_Msk                    _UINT32_(0x00000000)                                 /* (NVM_NVMLBWPINV) Register Mask  */


/* -------- NVM_NVMUBWP : (NVM Offset: 0x100) (R/W 32)  -------- */
#define NVM_NVMUBWP_RESETVALUE                _UINT32_(0x00)                                       /*  (NVM_NVMUBWP)   Reset Value */

#define NVM_NVMUBWP_UBWP0_Pos                 _UINT32_(0)                                          /* (NVM_NVMUBWP)  Position */
#define NVM_NVMUBWP_UBWP0_Msk                 (_UINT32_(0x1) << NVM_NVMUBWP_UBWP0_Pos)             /* (NVM_NVMUBWP)  Mask */
#define NVM_NVMUBWP_UBWP0(value)              (NVM_NVMUBWP_UBWP0_Msk & (_UINT32_(value) << NVM_NVMUBWP_UBWP0_Pos)) /* Assigment of value for UBWP0 in the NVM_NVMUBWP register */
#define NVM_NVMUBWP_UBWP1_Pos                 _UINT32_(1)                                          /* (NVM_NVMUBWP)  Position */
#define NVM_NVMUBWP_UBWP1_Msk                 (_UINT32_(0x1) << NVM_NVMUBWP_UBWP1_Pos)             /* (NVM_NVMUBWP)  Mask */
#define NVM_NVMUBWP_UBWP1(value)              (NVM_NVMUBWP_UBWP1_Msk & (_UINT32_(value) << NVM_NVMUBWP_UBWP1_Pos)) /* Assigment of value for UBWP1 in the NVM_NVMUBWP register */
#define NVM_NVMUBWP_UBWP2_Pos                 _UINT32_(2)                                          /* (NVM_NVMUBWP)  Position */
#define NVM_NVMUBWP_UBWP2_Msk                 (_UINT32_(0x1) << NVM_NVMUBWP_UBWP2_Pos)             /* (NVM_NVMUBWP)  Mask */
#define NVM_NVMUBWP_UBWP2(value)              (NVM_NVMUBWP_UBWP2_Msk & (_UINT32_(value) << NVM_NVMUBWP_UBWP2_Pos)) /* Assigment of value for UBWP2 in the NVM_NVMUBWP register */
#define NVM_NVMUBWP_UBWP3_Pos                 _UINT32_(3)                                          /* (NVM_NVMUBWP)  Position */
#define NVM_NVMUBWP_UBWP3_Msk                 (_UINT32_(0x1) << NVM_NVMUBWP_UBWP3_Pos)             /* (NVM_NVMUBWP)  Mask */
#define NVM_NVMUBWP_UBWP3(value)              (NVM_NVMUBWP_UBWP3_Msk & (_UINT32_(value) << NVM_NVMUBWP_UBWP3_Pos)) /* Assigment of value for UBWP3 in the NVM_NVMUBWP register */
#define NVM_NVMUBWP_UBWP4_Pos                 _UINT32_(4)                                          /* (NVM_NVMUBWP)  Position */
#define NVM_NVMUBWP_UBWP4_Msk                 (_UINT32_(0x1) << NVM_NVMUBWP_UBWP4_Pos)             /* (NVM_NVMUBWP)  Mask */
#define NVM_NVMUBWP_UBWP4(value)              (NVM_NVMUBWP_UBWP4_Msk & (_UINT32_(value) << NVM_NVMUBWP_UBWP4_Pos)) /* Assigment of value for UBWP4 in the NVM_NVMUBWP register */
#define NVM_NVMUBWP_UBWP5_Pos                 _UINT32_(5)                                          /* (NVM_NVMUBWP)  Position */
#define NVM_NVMUBWP_UBWP5_Msk                 (_UINT32_(0x1) << NVM_NVMUBWP_UBWP5_Pos)             /* (NVM_NVMUBWP)  Mask */
#define NVM_NVMUBWP_UBWP5(value)              (NVM_NVMUBWP_UBWP5_Msk & (_UINT32_(value) << NVM_NVMUBWP_UBWP5_Pos)) /* Assigment of value for UBWP5 in the NVM_NVMUBWP register */
#define NVM_NVMUBWP_UBWP6_Pos                 _UINT32_(6)                                          /* (NVM_NVMUBWP)  Position */
#define NVM_NVMUBWP_UBWP6_Msk                 (_UINT32_(0x1) << NVM_NVMUBWP_UBWP6_Pos)             /* (NVM_NVMUBWP)  Mask */
#define NVM_NVMUBWP_UBWP6(value)              (NVM_NVMUBWP_UBWP6_Msk & (_UINT32_(value) << NVM_NVMUBWP_UBWP6_Pos)) /* Assigment of value for UBWP6 in the NVM_NVMUBWP register */
#define NVM_NVMUBWP_UBWP7_Pos                 _UINT32_(7)                                          /* (NVM_NVMUBWP)  Position */
#define NVM_NVMUBWP_UBWP7_Msk                 (_UINT32_(0x1) << NVM_NVMUBWP_UBWP7_Pos)             /* (NVM_NVMUBWP)  Mask */
#define NVM_NVMUBWP_UBWP7(value)              (NVM_NVMUBWP_UBWP7_Msk & (_UINT32_(value) << NVM_NVMUBWP_UBWP7_Pos)) /* Assigment of value for UBWP7 in the NVM_NVMUBWP register */
#define NVM_NVMUBWP_UBWP8_Pos                 _UINT32_(8)                                          /* (NVM_NVMUBWP)  Position */
#define NVM_NVMUBWP_UBWP8_Msk                 (_UINT32_(0x1) << NVM_NVMUBWP_UBWP8_Pos)             /* (NVM_NVMUBWP)  Mask */
#define NVM_NVMUBWP_UBWP8(value)              (NVM_NVMUBWP_UBWP8_Msk & (_UINT32_(value) << NVM_NVMUBWP_UBWP8_Pos)) /* Assigment of value for UBWP8 in the NVM_NVMUBWP register */
#define NVM_NVMUBWP_UBWP9_Pos                 _UINT32_(9)                                          /* (NVM_NVMUBWP)  Position */
#define NVM_NVMUBWP_UBWP9_Msk                 (_UINT32_(0x1) << NVM_NVMUBWP_UBWP9_Pos)             /* (NVM_NVMUBWP)  Mask */
#define NVM_NVMUBWP_UBWP9(value)              (NVM_NVMUBWP_UBWP9_Msk & (_UINT32_(value) << NVM_NVMUBWP_UBWP9_Pos)) /* Assigment of value for UBWP9 in the NVM_NVMUBWP register */
#define NVM_NVMUBWP_UBWP10_Pos                _UINT32_(10)                                         /* (NVM_NVMUBWP)  Position */
#define NVM_NVMUBWP_UBWP10_Msk                (_UINT32_(0x1) << NVM_NVMUBWP_UBWP10_Pos)            /* (NVM_NVMUBWP)  Mask */
#define NVM_NVMUBWP_UBWP10(value)             (NVM_NVMUBWP_UBWP10_Msk & (_UINT32_(value) << NVM_NVMUBWP_UBWP10_Pos)) /* Assigment of value for UBWP10 in the NVM_NVMUBWP register */
#define NVM_NVMUBWP_UBWP11_Pos                _UINT32_(11)                                         /* (NVM_NVMUBWP)  Position */
#define NVM_NVMUBWP_UBWP11_Msk                (_UINT32_(0x1) << NVM_NVMUBWP_UBWP11_Pos)            /* (NVM_NVMUBWP)  Mask */
#define NVM_NVMUBWP_UBWP11(value)             (NVM_NVMUBWP_UBWP11_Msk & (_UINT32_(value) << NVM_NVMUBWP_UBWP11_Pos)) /* Assigment of value for UBWP11 in the NVM_NVMUBWP register */
#define NVM_NVMUBWP_UBWP12_Pos                _UINT32_(12)                                         /* (NVM_NVMUBWP)  Position */
#define NVM_NVMUBWP_UBWP12_Msk                (_UINT32_(0x1) << NVM_NVMUBWP_UBWP12_Pos)            /* (NVM_NVMUBWP)  Mask */
#define NVM_NVMUBWP_UBWP12(value)             (NVM_NVMUBWP_UBWP12_Msk & (_UINT32_(value) << NVM_NVMUBWP_UBWP12_Pos)) /* Assigment of value for UBWP12 in the NVM_NVMUBWP register */
#define NVM_NVMUBWP_UBWP13_Pos                _UINT32_(13)                                         /* (NVM_NVMUBWP)  Position */
#define NVM_NVMUBWP_UBWP13_Msk                (_UINT32_(0x1) << NVM_NVMUBWP_UBWP13_Pos)            /* (NVM_NVMUBWP)  Mask */
#define NVM_NVMUBWP_UBWP13(value)             (NVM_NVMUBWP_UBWP13_Msk & (_UINT32_(value) << NVM_NVMUBWP_UBWP13_Pos)) /* Assigment of value for UBWP13 in the NVM_NVMUBWP register */
#define NVM_NVMUBWP_UBWP14_Pos                _UINT32_(14)                                         /* (NVM_NVMUBWP)  Position */
#define NVM_NVMUBWP_UBWP14_Msk                (_UINT32_(0x1) << NVM_NVMUBWP_UBWP14_Pos)            /* (NVM_NVMUBWP)  Mask */
#define NVM_NVMUBWP_UBWP14(value)             (NVM_NVMUBWP_UBWP14_Msk & (_UINT32_(value) << NVM_NVMUBWP_UBWP14_Pos)) /* Assigment of value for UBWP14 in the NVM_NVMUBWP register */
#define NVM_NVMUBWP_UBWP15_Pos                _UINT32_(15)                                         /* (NVM_NVMUBWP)  Position */
#define NVM_NVMUBWP_UBWP15_Msk                (_UINT32_(0x1) << NVM_NVMUBWP_UBWP15_Pos)            /* (NVM_NVMUBWP)  Mask */
#define NVM_NVMUBWP_UBWP15(value)             (NVM_NVMUBWP_UBWP15_Msk & (_UINT32_(value) << NVM_NVMUBWP_UBWP15_Pos)) /* Assigment of value for UBWP15 in the NVM_NVMUBWP register */
#define NVM_NVMUBWP_UBWP16_Pos                _UINT32_(16)                                         /* (NVM_NVMUBWP)  Position */
#define NVM_NVMUBWP_UBWP16_Msk                (_UINT32_(0x1) << NVM_NVMUBWP_UBWP16_Pos)            /* (NVM_NVMUBWP)  Mask */
#define NVM_NVMUBWP_UBWP16(value)             (NVM_NVMUBWP_UBWP16_Msk & (_UINT32_(value) << NVM_NVMUBWP_UBWP16_Pos)) /* Assigment of value for UBWP16 in the NVM_NVMUBWP register */
#define NVM_NVMUBWP_UBWP17_Pos                _UINT32_(17)                                         /* (NVM_NVMUBWP)  Position */
#define NVM_NVMUBWP_UBWP17_Msk                (_UINT32_(0x1) << NVM_NVMUBWP_UBWP17_Pos)            /* (NVM_NVMUBWP)  Mask */
#define NVM_NVMUBWP_UBWP17(value)             (NVM_NVMUBWP_UBWP17_Msk & (_UINT32_(value) << NVM_NVMUBWP_UBWP17_Pos)) /* Assigment of value for UBWP17 in the NVM_NVMUBWP register */
#define NVM_NVMUBWP_UBWP18_Pos                _UINT32_(18)                                         /* (NVM_NVMUBWP)  Position */
#define NVM_NVMUBWP_UBWP18_Msk                (_UINT32_(0x1) << NVM_NVMUBWP_UBWP18_Pos)            /* (NVM_NVMUBWP)  Mask */
#define NVM_NVMUBWP_UBWP18(value)             (NVM_NVMUBWP_UBWP18_Msk & (_UINT32_(value) << NVM_NVMUBWP_UBWP18_Pos)) /* Assigment of value for UBWP18 in the NVM_NVMUBWP register */
#define NVM_NVMUBWP_UBWP19_Pos                _UINT32_(19)                                         /* (NVM_NVMUBWP)  Position */
#define NVM_NVMUBWP_UBWP19_Msk                (_UINT32_(0x1) << NVM_NVMUBWP_UBWP19_Pos)            /* (NVM_NVMUBWP)  Mask */
#define NVM_NVMUBWP_UBWP19(value)             (NVM_NVMUBWP_UBWP19_Msk & (_UINT32_(value) << NVM_NVMUBWP_UBWP19_Pos)) /* Assigment of value for UBWP19 in the NVM_NVMUBWP register */
#define NVM_NVMUBWP_UBWP20_Pos                _UINT32_(20)                                         /* (NVM_NVMUBWP)  Position */
#define NVM_NVMUBWP_UBWP20_Msk                (_UINT32_(0x1) << NVM_NVMUBWP_UBWP20_Pos)            /* (NVM_NVMUBWP)  Mask */
#define NVM_NVMUBWP_UBWP20(value)             (NVM_NVMUBWP_UBWP20_Msk & (_UINT32_(value) << NVM_NVMUBWP_UBWP20_Pos)) /* Assigment of value for UBWP20 in the NVM_NVMUBWP register */
#define NVM_NVMUBWP_UBWP21_Pos                _UINT32_(21)                                         /* (NVM_NVMUBWP)  Position */
#define NVM_NVMUBWP_UBWP21_Msk                (_UINT32_(0x1) << NVM_NVMUBWP_UBWP21_Pos)            /* (NVM_NVMUBWP)  Mask */
#define NVM_NVMUBWP_UBWP21(value)             (NVM_NVMUBWP_UBWP21_Msk & (_UINT32_(value) << NVM_NVMUBWP_UBWP21_Pos)) /* Assigment of value for UBWP21 in the NVM_NVMUBWP register */
#define NVM_NVMUBWP_UBWP22_Pos                _UINT32_(22)                                         /* (NVM_NVMUBWP)  Position */
#define NVM_NVMUBWP_UBWP22_Msk                (_UINT32_(0x1) << NVM_NVMUBWP_UBWP22_Pos)            /* (NVM_NVMUBWP)  Mask */
#define NVM_NVMUBWP_UBWP22(value)             (NVM_NVMUBWP_UBWP22_Msk & (_UINT32_(value) << NVM_NVMUBWP_UBWP22_Pos)) /* Assigment of value for UBWP22 in the NVM_NVMUBWP register */
#define NVM_NVMUBWP_UBWP23_Pos                _UINT32_(23)                                         /* (NVM_NVMUBWP)  Position */
#define NVM_NVMUBWP_UBWP23_Msk                (_UINT32_(0x1) << NVM_NVMUBWP_UBWP23_Pos)            /* (NVM_NVMUBWP)  Mask */
#define NVM_NVMUBWP_UBWP23(value)             (NVM_NVMUBWP_UBWP23_Msk & (_UINT32_(value) << NVM_NVMUBWP_UBWP23_Pos)) /* Assigment of value for UBWP23 in the NVM_NVMUBWP register */
#define NVM_NVMUBWP_ULOCK_Pos                 _UINT32_(31)                                         /* (NVM_NVMUBWP)  Position */
#define NVM_NVMUBWP_ULOCK_Msk                 (_UINT32_(0x1) << NVM_NVMUBWP_ULOCK_Pos)             /* (NVM_NVMUBWP)  Mask */
#define NVM_NVMUBWP_ULOCK(value)              (NVM_NVMUBWP_ULOCK_Msk & (_UINT32_(value) << NVM_NVMUBWP_ULOCK_Pos)) /* Assigment of value for ULOCK in the NVM_NVMUBWP register */
#define NVM_NVMUBWP_Msk                       _UINT32_(0x80FFFFFF)                                 /* (NVM_NVMUBWP) Register Mask  */

#define NVM_NVMUBWP_UBWP_Pos                  _UINT32_(0)                                          /* (NVM_NVMUBWP Position)  */
#define NVM_NVMUBWP_UBWP_Msk                  (_UINT32_(0xFFFFFF) << NVM_NVMUBWP_UBWP_Pos)         /* (NVM_NVMUBWP Mask) UBWP */
#define NVM_NVMUBWP_UBWP(value)               (NVM_NVMUBWP_UBWP_Msk & (_UINT32_(value) << NVM_NVMUBWP_UBWP_Pos)) 

/* -------- NVM_NVMUBWPCLR : (NVM Offset: 0x104) (R/W 32)  -------- */
#define NVM_NVMUBWPCLR_RESETVALUE             _UINT32_(0x00)                                       /*  (NVM_NVMUBWPCLR)   Reset Value */

